'''Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.

Пользователь вводит 2 числа. n — кол-во элементов первого множества.
m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.'''

n = (int(input("Введите число элементов первого множества N: ")))
num_list_1 = []
for i in range(n):
    num = int(input("Введите элементы первого множества "))
    num_list_1.append(num)

m = (int(input("Введите число элементов вторго множества M: ")))
num_list_2 = []
for i in range(m):
    num = int(input("Введите элементы второго множества: "))
    num_list_2.append(num)

print(f"Исходный массив N: ", num_list_1)
print(f"Исходный массив M: ", num_list_2)

num_list3 = num_list_1 + num_list_2
print(f"Результат: ", sorted(set(num_list3)))

